** Call it in main
#+BEGIN_SRC rust :tangle src/main.rs
use literate::bin_search;

fn main() {
    let target = 'a';
    let collection = ['a', 'b', 'c'];

    println!("Target: {}", target);
    print!("Collection: ");
    for i in 0..collection.len() {
        print!("{}, ", collection[i]);
    }
    println!("");

    match bin_search(&target, &collection) {
        Some(i) => println!("Result: {}", collection[i]),
        None => println!("Not found")
    }
}
#+END_SRC

Run with =cargo run=.

#+BEGIN_SRC sh :results raw
cargo run
#+END_SRC

#+RESULTS:
Target: a
Collection: a, b, c,
Result: a

